## Base
linux
linux-firmware
linux-headers
base
base-devel
btrfs-progs
dhcpcd
iwd
bash-completion
sudo
refind
man-db
man-pages

## Graphics
mesa-utils
nvidia-dkms
nvidia-prime
vulkan-intel

## Neovim
neovim
git
npm
tree-sitter-cli
nodejs
unzip

## Fonts
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
ttf-noto-nerd

## Hyprland 
hypridle
hyprland
hyprlock
hyprpaper
xdg-desktop-portal-hyprland
polkit
brightnessctl

## Audio
sof-firmware
pipewire
pipewire-alsa
pipewire-pulse
alsa-firmware
alsa-tools
alsa-utils
helvum
pamixer
pavucontrol

## Others 
dua-cli
flatpak
chromium
kitty
nemo
nemo-fileroller
nemo-preview
nemo-terminal
