## Base
linux
linux-firmware
linux-headers
base
base-devel
btrfs-progs
dhcpcd
iwd
bash-completion
sbsigntools
sudo
refind
man-db
man-pages
tree
plymouth
greetd
greetd-tuigreet

## Bluetooth
bluez
bluez-utils

## Graphics
mesa-utils
nvidia-dkms
nvidia-prime
vulkan-intel

## Neovim
neovim
git
npm
tree-sitter-cli
nodejs
unzip
luarocks
ripgrep

## Fonts
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
ttf-noto-nerd

## Hyprland 
hypridle
hyprland
hyprlock
hyprpaper
xdg-desktop-portal-hyprland
xdg-desktop-portal-gtk
polkit
brightnessctl
wl-clipboard
polkit-gnome

## Audio
sof-firmware
pipewire
pipewire-alsa
pipewire-pulse
alsa-firmware
alsa-tools
alsa-utils
helvum
pamixer
pavucontrol

## AGS
glib2-devel
gobject-introspection
gtk-layer-shell
typescript
sassc
esbuild
gjs
upower

## Daily applications 
kitty
nemo
nemo-fileroller
nemo-preview
yazi
wofi
thunderbird
chromium
zoxide
bitwarden

## Others 
cups
dua-cli
btop
foliate
docker
gparted
fzf

## Not sorted yet
d-spy
flatpak
nss-mdns
ntp
